## Стиль программирования ##
# Важно, чтобы код читался как можно проще, даже в громоздких проектах, поэтому вот некоторые рекомендации по оформлению кода на Python.

### Рекомендации по стилю ###
# В сети есть документ, под названием PEP8 (Python Enchancement Proposal) 
# и как раз в нём прописаны правила по оформлению кода. 
# Они пригодятся тогда, когда будут написаны тысячи строк кода и 
# понадобится делать отладку. Ведь если не соблюсти правила оформления, 
# можно запутаться в собственном коде и запутать тех, кто решит прочитать 
# ваш код.
# Конечно, оформление кода это дело каждого, можно придумать тысячу 
# вариантов для его отображения, но это считается плохим тоном.

### Отступы ###
# PEP8 рекомендует оформлять отступы четырьмя пробелами.
# В программах для написания кода, часто можно встретить табуляцию 
# вместо пробелов. 
# И тот и тот вариант подходит, но главное не смешивать проблелы и табы

### Длина строк ###
# Многие программисты Python рекомендуют ограничивать длину строк 80 
# символами, но некоторые используют ограничение в 99 символов.

### Пустые строки ###
# Применяются для визуализации группировки частей программы, 
# но злоупотрелять ими не стоит, иначе велик шанс запутаться. 
# Только если вы не планируете показывать свой код всем подряд.

# Исходное руководство по стилю можно найти по ссылке:
# https://python.org/dev/peps/pep-0008/
