# В Python с числами можно выполнять различные математические операции
сумма = 2 + 3
print(сумма)
print()

разность = 3 - 2
print(разность)
print()

умножение = 2 * 3
print(умножение)
print()

# при делении результатом будет число с плавающей запятой или вещественное
деление = 3 / 2
print(деление)
print()

возведение_в_степень = 3 ** 2
print(возведение_в_степень)
print()

"""
Чтобы числа лучше читались, их можно писать через нижнее подчёркивание
вывод будет без подчёркиваний
Функция доступна только с версии Python 3.6
"""

universe_age = 14_000_000_000
print(universe_age)
print()

# В Python можно выполнять множественное присваивание значений
x,y,z = 14,67,1984
print(x,y,z)
print()

"""
# Константы неизменяемы на протяжении всего жизненного цикла программы
# записываются буквами верхнего регистра, так как функции const нет
"""

MAX_CONNECTIONS = 1000
