## Стилевое оформление функций ##
"""
1) Функции должны иметь содержательные имена,
состоящие из букв нижнего регистра и символов подчёркивания.

2) Каждая функция должна быть снабжена комментарием, который кратко поясняет,
что делает эта функция.

3) Если для параметра задаётся значение по умолчанию, слева и справа
от знака равенства не должно быть пробелов:
def имя_функции(параметр_0, параметр_1='значение_по_умолчанию')

4) Те же соглашения должны применяться для именованных аргументов
в вызовах функций:
имя_функции(значение_0, параметр_1='значение')

5) Многие редакторы автоматически выравнивают дополнительные строки параметров
по отступам, установленным в первой строке:
def имя_функции(
		параметр_0, параметр_1, параметр_2,
		параметр_3, параметр_4, параметр_5):
	тело функции...
	
6) Если программа или модуль состоят из нескольких функций,
эти функции можно разделить двумя пустыми строками.
Так будет проще увидеть где начинается и заканчивается одна функция
и начинается другая.

7) Все команды import следует записывать в начале файла.
У этого правила есть только одно исключение: файл может начинаться
с комментариев, описывающих программу в целом.
"""
